espressif/esp-insights/unit_test_app/sdkconfig.ci.linux
# Linux host test config. RAM data store only — the RTC-backed store
# depends on RTC memory which has no Linux equivalent and stays ESP-only.
CONFIG_IDF_TARGET="linux"
CONFIG_COMPILER_OPTIMIZATION_DEFAULT=y
CONFIG_UNITY_ENABLE_FLOAT=y
CONFIG_UNITY_ENABLE_DOUBLE=y
CONFIG_UNITY_ENABLE_COLOR=y
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=y
CONFIG_UNITY_ENABLE_FIXTURE=y
CONFIG_DIAG_DATA_STORE_RAM=y
CONFIG_APP_TEST_DATA_STORE=y
CONFIG_COMPILER_WARN_WRITE_STRINGS=n
